#!/usr/bin/env python
# -*- coding: UTF-8 -*-

#-------------------------------------------------------------------------------
# Name:        модуль1
# Purpose:
#
# Author:      Prapor
#
# Created:     02.07.2017
# Copyright:   (c) Prapor 2017
# Licence:     <your licence>
#-------------------------------------------------------------------------------

def main():
    #print ("Если в ресторане Вам принесли счёт 19 доларов, а вас четверо")
    #print ("На четверых по сколько это?")
    print ("""
            Если в ресторане Вам принесли счёт 19 доларов, а вас четверо.
            На четверых по сколько это?
          """)

    print (19 / 4) #4.75

    print ('19 / 4 = ', 19 / 4) #19 / 4 =  4.75

    print ('19 / 4 = ', 19 / 4, 'долара') # 19 / 4 =  4.75 долара

    input ('Сейчас я нажму Enter на клавиатуре и ты закроешься')

if __name__ == '__main__':
    main()
