#!/usr/bin/env python
# -*- coding: UTF-8 -*-

#-------------------------------------------------------------------------------
# Name:        модуль1
# Purpose:
#
# Author:      Prapor
#
# Created:     04.07.2017
# Copyright:   (c) Prapor 2017
# Licence:     <your licence>
#-------------------------------------------------------------------------------

def main():
    num = 1 / 3 # 0.3333333333333333
    print (num)

    print (round (num)) # 0

    num = 1 / 3.0   # 0.3333333333333333
    print (num)

    print ('%4.2f' % num)   #     0.33

    print ('%4.4f' % num)   #     0.3333

    print ('%4.1f' % num)   #     0.3

    print ('%0.1f' % num)   # 0.3

    print ('%8.2f' % num)   #         0.33
            #8 - количество отступов
            #2 - количество знаков после запятой
            #f - вещественное число
            #% - маркер пременной, которая будет отформатировнна
            #    при переводе в строку.
    print ('%.2f' % num)   #0.33 Если отступы не нужны!!



if __name__ == '__main__':
    main()
