#Escape - последовательности
# \\ 
print ("сумма 7\\8") #Когда в литерале находятся имвол "\\",
                     #то один слеш экранируется вторым, т.е.
                     #в данной ситуации выведется один символ "\"
# \'
print ('Выводится \'')  #Здесь будет выведена одна ковычка

# \"
print ('Выводится \"')  #Здесь будет выведена двойная ковычка
print ("Выводится \"")  #Здесь будет выведена двойная ковычка

# \a
print ("Выводится \a")  #Выводится звук системного динамика

# \n
print ("Что происходит? \n\n\n") #Здесь выведется три новых строки

# \t
print ("\tЧто происходит?") #Здесь выведется строка не сначала
print ("\t\t\t\t\\\\\\\\\\\\\\\\\\\\")

s = Вася
