#-------------------------------------------------------------------------------
# Name:        модуль1
# Purpose:
#
# Author:      Prapor
#
# Created:     23.06.2017
# Copyright:   (c) Prapor 2017
# Licence:     <your licence>
#-------------------------------------------------------------------------------

def main():
    s = 'Вася' * 3      #ВасяВасяВася
    print(s)
    s = 'Вася ' * 3     #Вася Вася Вася
    print(s)
    s = 'Вася, ' * 3    #Вася, Вася, Вася,
    print(s)
    s = '- ' * 15    #- - - - - - - - - - - - - - -
    print(s)

if __name__ == '__main__':
    main()
