#!/usr/bin/env python
# -*- coding: UTF-8 -*-

#-------------------------------------------------------------------------------
# Name:        модуль1
# Purpose:
#
# Author:      Prapor
#
# Created:     26.06.2017
# Copyright:   (c) Prapor 2017
# Licence:     <your licence>
#-------------------------------------------------------------------------------

def main():
    #w = '33' + 5   #Данный код приведет к ошибке, т.к нельзя
                    #складывть различные типы данных друг с другом
    w = int('33') + 5
    print (w)   #38

    w = '33' + repr(5)
    print (w)   #'335'  см. конкотенация строк

    w = str('42') + '5'
    print (w)   #'425'  см. конкотенация строк

if __name__ == '__main__':
    main()
