#!/usr/bin/env python
# -*- coding: UTF-8 -*-

#-------------------------------------------------------------------------------
# Name:        модуль1
# Purpose:
#
# Author:      Prapor
#
# Created:     04.07.2017
# Copyright:   (c) Prapor 2017
# Licence:     <your licence>
#-------------------------------------------------------------------------------

def main():
    a = 1
    b = 3
    c = a / b
    print (c)   #0.3333333333333333
    print ('%.3f' % c)  #0.333
    print ("%.3f" % c)  #0.333
    c = 5
    print ('%.2f' % c)  #5.00

    c = 5.5578
    print ("%.2f" % c)  #5.56

    c = 5.5
    print ('%.3f' % c)  #5.500

    c = round (5.5)
    print (c)  #6

    c = round (5.1)
    print (c)  #5
    #Автор сторонник следующего подхода, мы внутренними средствами Python
    #считаем, а потом прописываем как вывести,
    #так чтоб это было красиво и удобочитаемо.
if __name__ == '__main__':
    main()
