#!/usr/bin/env python
# -*- coding: UTF-8 -*-

#-------------------------------------------------------------------------------
# Name:        модуль1
# Purpose:
#
# Author:      Prapor
#
# Created:     04.07.2017
# Copyright:   (c) Prapor 2017
# Licence:     <your licence>
#-------------------------------------------------------------------------------

def main():
    #После того как мы разберемся со словарями и списками, автор предлагает
    #очень внимательно разобраться с Множествами еще одним типом
    #коллекций в Python.

    #Для более научных вычислений автор предлагает изучить стронний пакет NumPy.

    #Файл со встроенными функциями python на русском языке
    #Python + Jango, Видеоуроки для начинающих\Kurs\1_PYTHON\Платный\
    #1_Раздел 1. Встроенные типы объектов в Python\1_Числа в Python\add\
    #Встроенные функции.pdf
    pass

if __name__ == '__main__':
    main()
