# -*- coding: UTF-8 -*-

#-------------------------------------------------------------------------------
# Name:        модуль1
# Purpose:
#
# Author:      Prapor
#
# Created:     26.06.2017
# Copyright:   (c) Prapor 2017
# Licence:     <your licence>
#-------------------------------------------------------------------------------

def main():
    p = "Вася, Катя, Муся, Вася"    #Вася, Катя, Муся, Вася
    print (p)

    p = "Вася,\n Катя, Муся,\n \t Вася" #Вася,
                                        # Катя, Муся,
 	                                    #     Вася
    print (p)

if __name__ == '__main__':
    main()
