#!/usr/bin/env python
# -*- coding: UTF-8 -*-

#-------------------------------------------------------------------------------
# Name:        модуль1
# Purpose:
#
# Author:      Prapor
#
# Created:     02.07.2017
# Copyright:   (c) Prapor 2017
# Licence:     <your licence>
#-------------------------------------------------------------------------------

def main():
    print ("""
 Если, теже четверо пиратов,
решат поделить поровну, то сколько монет
останется ничейных?""")

    print ("""
     \t\tЕсли, теже четверо пиратов,
    \t\tрешат поделить поровну, \n\t\t\tто сколько монет
    \t\tостанется ничейных?""")
    #Находим остаток от деления
    print ('107 % 4 =', 107 % 4)
if __name__ == '__main__':
    main()
