#!/usr/bin/env python
# -*- coding: UTF-8 -*-

#-------------------------------------------------------------------------------
# Name:        модуль1
# Purpose:
#
# Author:      Prapor
#
# Created:     05.07.2017
# Copyright:   (c) Prapor 2017
# Licence:     <your licence>
#-------------------------------------------------------------------------------

def main():
    #Словари списки Марк Лутц 254
    #Самерфилд списки 135, словари 152
    #Подробный справочник списки 32, словари 36
    #Джаного словари 57, списки 46(хорошие практические примеры)
    #Стандартная Библиотека Python - 4.6 Последовательность Типов - список,
    #кортеж, диапазон.
    #Основы программирования на Python списки 31, словари 34 (отсюда черпать
    #примеры).

    #Ссылки на сайты http://pep8.ru/link/
    #Вот такое сделать http://www.codecademy.com/

    #Скачать с этих блогов эмейлы http://pep8.ru/blog/sources/

    #Обязательно вбить в поисковике "списки в python" или
    #"примеры работы со списками в python" и посмотреть примеры
    #чьих нибудь примеров работы со списками.
    pass

if __name__ == '__main__':
    main()
