#!/usr/bin/env python
# -*- coding: UTF-8 -*-

#-------------------------------------------------------------------------------
# Name:        модуль1
# Purpose:
#
# Author:      Prapor
#
# Created:     02.07.2017
# Copyright:   (c) Prapor 2017
# Licence:     <your licence>
#-------------------------------------------------------------------------------

def main():
    #print ("Если четверо пиратов найдут ларчик в котором 107 монет")
    #print ("И решат разделить поравну, то сколько целых монет достанется каждому?")
    print ("""
            Если четверо пиратов найдут ларчик в котором 107 монет и решат
            разделить поравну, то сколько целых монет достанется каждому?
          """)

    print (107 / 4) #26.75

    print (107 // 4) #26

    pirate = 4
    moneta = 107

    print (moneta // pirate) #26

    tire = '-'
    print (tire * 20)   #--------------------

    print ('107 разделить на 4 равно', moneta // pirate)    #26

    summa = moneta // pirate

    print ('107 разделить на 4 равно', summa)   #26

    input('Нажмите Enter чтобы выйти')



if __name__ == '__main__':
    main()
